Autodesk.Revit.DB.FilterRule.GetRuleParameter
Returns the ElementId of the parameter associated to this FilterRule if there is one,
or invalidElementId if there is no associated parameter.
Returns:
The parameter id if there is an associated parameter, or invalidElementId if not.
Since:
2019

Autodesk.Revit.DB.FilterRule.ElementPasses(Autodesk.Revit.DB.Element)
Derived classes override this method to implement the test that determines
whether the given element passes this rule or not.
element:
The element to test against the rule.
Returns:
True if the element satisfies the rule, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.FilterRule.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FilterRule
Defines a boolean operation that can be used to cull elements from a document.
Since:
2011